Core/src/Documents/ПеремещениеВА/ПеремещениеВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеВА</name>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDTТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиницаПолучатель</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПолучатель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизациюВТекущемМесяце</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/ПеремещениеВА/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеВА);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеВА.Ссылка,
	|	ПеремещениеВА.Номер,
	|	ПеремещениеВА.Дата,
	|	ПеремещениеВА.Организация
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.ПеремещениеВА КАК ПеремещениеВА
	|ГДЕ
	|	ПеремещениеВА.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка,
	|	ПеремещениеВАВнеоборотныеАктивы.НомерСтроки,
	|	ПеремещениеВАВнеоборотныеАктивы.ВнеоборотныйАктив,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиница,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиницаПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.Адрес,
	|	ПеремещениеВАВнеоборотныеАктивы.АдресПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.ПервоначальнаяСтоимость,
	|	ПеремещениеВАВнеоборотныеАктивы.НачислятьАмортизациюВТекущемМесяце,
	|	ПеремещениеВАВнеоборотныеАктивы.СрокИспользованияДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатрат,
	|	ПеремещениеВАВнеоборотныеАктивы.НаправлениеДеятельности,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатратРегл,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Дата КАК Период,
	|	&ВалютаУчета КАК Валюта,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Организация КАК Организация
	|ПОМЕСТИТЬ ВременнаяТаблицаВнеоборотныхАктивов
	|ИЗ
	|	Документ.ПеремещениеВА.ВнеоборотныеАктивы КАК ПеремещениеВАВнеоборотныеАктивы
	|ГДЕ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка = &Ссылка";
	
	Запрос.ВыполнитьПакет();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ПеремещениеВА(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиница,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце КАК ПрименитьВТекущемМесяце,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ТаблицаДокумента.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.АдресПолучатель КАК Адрес,
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетЗатратРегл 
	|ИЗ
	|	ВременнаяТаблицаВнеоборотныхАктивов КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПараметрыВнеоборотныхАктивов()
